# Data Cleaning and Preparation

During the course of dping data analysis and modeling, a significant amount of time is spent on data preparation: loading, cleaning, transforming, and rearranging. Such tasks are often reported to take up 80% or more of the analyst's time.

pandas, along with the built-in Python languange features, provides a high-level, flexible, and fast set of tools to enable you to manipulate data into the right form.

In [1]:
import pandas as pd
import numpy as np

## Handling and Missing Data

For nmeric data, pandas uses the floating-point value __NaN__ (Not a Number) to represent missing data. We call this a _sentinel value_ that can be easity detected:

In [2]:
string_data = pd.Series(['aardvark','artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

The built-in Python __None__ value is also treated as NA in object arrays:

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

There are a few ways to filter out missing data. While you always have the option to do it by hand using, __pandas.isnull__ and boolean indexing, the __dropna__ can be helpful. 
On a Series, it returns the Series with only the non-null data and index value:

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
3    7.0
dtype: float64

This is equivalent to:

In [10]:
data[data.notnull()]

0    1.0
2    3.5
3    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4]=NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7,3))

In [20]:
df.iloc[:4,1]=NA

In [21]:
df.iloc[:2,2]=NA

In [22]:
df

          0         1         2
0 -1.167726       NaN       NaN
1  0.045653       NaN       NaN
2 -0.045300       NaN -0.036979
3  0.132123       NaN -0.466037
4 -1.052871  0.190665 -0.667931
5  1.209273 -0.471294  1.350921
6 -0.576775 -1.798988 -0.755029

In [23]:
df.dropna()

          0         1         2
4 -1.052871  0.190665 -0.667931
5  1.209273 -0.471294  1.350921
6 -0.576775 -1.798988 -0.755029

In [24]:
df.dropna(thresh=2)

          0         1         2
2 -0.045300       NaN -0.036979
3  0.132123       NaN -0.466037
4 -1.052871  0.190665 -0.667931
5  1.209273 -0.471294  1.350921
6 -0.576775 -1.798988 -0.755029

### Filling In Missing Data

In [25]:
df.fillna(0)

          0         1         2
0 -1.167726  0.000000  0.000000
1  0.045653  0.000000  0.000000
2 -0.045300  0.000000 -0.036979
3  0.132123  0.000000 -0.466037
4 -1.052871  0.190665 -0.667931
5  1.209273 -0.471294  1.350921
6 -0.576775 -1.798988 -0.755029

In [26]:
df.fillna({1: 0.5,2: 0})

          0         1         2
0 -1.167726  0.500000  0.000000
1  0.045653  0.500000  0.000000
2 -0.045300  0.500000 -0.036979
3  0.132123  0.500000 -0.466037
4 -1.052871  0.190665 -0.667931
5  1.209273 -0.471294  1.350921
6 -0.576775 -1.798988 -0.755029

In [27]:
_ = df.fillna(0, inplace=True) # replaces the existing object in-place

In [28]:
df

          0         1         2
0 -1.167726  0.000000  0.000000
1  0.045653  0.000000  0.000000
2 -0.045300  0.000000 -0.036979
3  0.132123  0.000000 -0.466037
4 -1.052871  0.190665 -0.667931
5  1.209273 -0.471294  1.350921
6 -0.576775 -1.798988 -0.755029

In [29]:
df = pd.DataFrame(np.random.randn(6,3))

In [30]:
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA

In [31]:
df

          0         1         2
0 -0.436441 -0.122580 -0.475352
1  0.161692 -0.321807 -0.289149
2 -0.472032       NaN -2.048687
3  0.159869       NaN -0.394772
4 -0.340361       NaN       NaN
5 -0.031881       NaN       NaN

In [32]:
df.fillna(method='ffill')

          0         1         2
0 -0.436441 -0.122580 -0.475352
1  0.161692 -0.321807 -0.289149
2 -0.472032 -0.321807 -2.048687
3  0.159869 -0.321807 -0.394772
4 -0.340361 -0.321807 -0.394772
5 -0.031881 -0.321807 -0.394772

In [33]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.436441 -0.122580 -0.475352
1  0.161692 -0.321807 -0.289149
2 -0.472032 -0.321807 -2.048687
3  0.159869 -0.321807 -0.394772
4 -0.340361       NaN -0.394772
5 -0.031881       NaN -0.394772

In [34]:
data = pd.Series([1.,NA,3.5,NA,7])

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

So far we've been concerned with rearranging data. Filtering, cleaning, and other transformations are another class of important operations.

### Removing Duplicates

### Transforming Data Using a Function or Mapping

### Replacing Values

### Renaming Axis Indexes

### Discretization and Binning

### Detecting and Filtering Outliers

### Permutation and Random Sampling

### Computating Indicator / Dummy Variables

## String Manipulation

### String Object Methods

### Regular Expressions

### Vectorized String Functions in pandas